//SUMANG1 JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=NOLIMIT,REGION=0M,COND=(16,LT)
//        JCLLIB ORDER=(CUST.V50.PROCLIB)
//*
//*
//*
//TEST001 EXEC PGM=IKJEFT01
//STEPLIB DD DSN=SUMANG.DBBW.LOAD,DISP=SHR
//        DD DSN=DSN.V11R1M0.SDSNLOAD,DISP=SHR
//SYSTSIN  DD *
    DSN SYSTEM(DB2C)
      RUN PROGRAM(GETAAVG)-
      PLAN(NEWCPL)-
      PARM('0AVMOT0000000001Y') -
      LIBRARY('SUMANG.DBBW.LOAD')
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*